<template>
    <section class="hero is-info is-fullheight">
        <div class="hero-body">
            <div class="container">
                <div class="card">
                    <div class="card-content">
                        <div class="content">
                            <h1>Лицензионное соглашение и правила использования сервиса "TODO LIST"</h1>

                            <h2>Введение:</h2>

                            <p>Данное лицензионное соглашение (далее – "Соглашение") представляет собой юридическое соглашение между вами (физическим или юридическим лицом) и провайдером услуг, предоставляющим сервис "TODO LIST" (далее – "Сервис").</p>

                            <p>Сервис является учебным проектом, созданным исключительно в образовательных целях. Сервис не является официальным продуктом, сервисом, программным обеспечением, представительством или иным проектом компании «ЭФКО Цифровые решения», не имеет с указанной компанией юридической, корпоративной, договорной, организационной или иной связи, а также не действует от ее имени и в ее интересах.</p>

                            <h2>1. Предоставление лицензии:</h2>

                            <p>
                                При соблюдении условий настоящего Соглашения, вы получаете ограниченное, непередаваемое и неисключительное право использования Сервиса.
                            </p>

                            <h2>2. Правила использования:</h2>

                            <p>
                                2.1. Регистрация. Для использования Сервиса требуется регистрация. Вы обязуетесь предоставлять достоверную и актуальную информацию при регистрации и поддерживать ее актуальность.
                                <br>
                                2.2. Безопасность. Вы несете ответственность за безопасность своего аккаунта и пароля. При несанкционированном использовании вашего аккаунта немедленно уведомляйте провайдера услуг.
                                <br>
                                2.3. Авторские права. Вы обязуетесь соблюдать авторские права и интеллектуальную собственность, связанные с содержанием, которое вы добавляете в Сервис.
                                <br>
                                2.4. Запрещенное содержание. Запрещено добавление в Сервис контента, нарушающего законы или права третьих лиц, а также содержащего вирусы, вредоносные программы и т.д.
                                <br>
                                2.5. Пользовательские данные. Вы самостоятельно определяете состав, содержание и объем данных, которые вводите, размещаете или сохраняете в Сервисе. Вы несете ответственность за законность, достоверность, корректность и допустимость таких данных, а также за наличие необходимых прав и оснований для их обработки и размещения в Сервисе.
                                <br>
                                2.6. Конфиденциальность данных. Провайдер услуг не передает введенные пользователями данные третьим лицам, за исключением случаев, когда такая передача прямо требуется применимым законодательством либо необходима для исполнения обязательных требований уполномоченных государственных органов.
                            </p>

                            <h2>3. Ограничение ответственности:</h2>
                            <p>
                                3.1. Сервис предоставляется "как есть", без гарантий любого рода. Провайдер услуг не несет ответственности за убытки, прямые или косвенные, связанные с использованием или невозможностью использования Сервиса.
                                <br>
                                3.2. Провайдер услуг не гарантирует непрерывную работу Сервиса и не несет ответственности за временные перерывы, задержки или проблемы в его функционировании.
                                <br>
                                3.3. Провайдер услуг не несет ответственности за содержание, характер, достоверность, полноту, законность и последствия использования данных, введенных, размещенных или сохраненных пользователями в Сервисе.
                            </p>

                            <h2>4. Завершение соглашения:</h2>
                            <p>
                                4.1. Провайдер услуг имеет право завершить это Соглашение и приостановить предоставление Сервиса в случае нарушения вами его условий.
                                <br>
                                4.2. После завершения Соглашения все права, предоставленные вам, прекращают свое действие, и вы обязаны прекратить использование Сервиса.
                            </p>

                            <h2>5. Прочие условия:</h2>
                            <p>
                                5.1. Изменения. Провайдер услуг вправе изменять условия Соглашения. Изменения вступают в силу с момента их публикации.
                                <br>
                                5.2. Применимое право. Настоящее Соглашение регулируется законами той юрисдикции, в которой провайдер услуг имеет свое место нахождения.
                                <br>
                                5.3. Учебный характер проекта. Сервис предназначен для демонстрации, обучения и тестирования функциональности TODO-приложения. Использование Сервиса для хранения критически важных, конфиденциальных, коммерческих, персональных или иных чувствительных данных не рекомендуется.
                            </p>

                            <h3>Принимая условия настоящего Соглашения, вы выражаете свое согласие с его положениями и обязуетесь соблюдать их.</h3>

                            <p>Дата вступления в силу: 11.12.2023</p>

                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
</template>

<script>
export default {
    name: 'TermsPage',
    layout: 'single-page',
}

</script>

<style scoped>

</style>